ci4/app/Controllers/Artikel.php

  public function admin_index()
  {

    $model = new ArtikelModel();
    $baru = $this->request->getVar('baru') ?? '';
    $data = [
      #data dibatasi 10 record per halaman
      'title' => "Daftar Artikel",
      'baru' => $baru,
      'artikel' => $model->like('judul', $baru)->paginate(2),
---
SELECT *
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
 LIMIT 4, 2
SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'

  public function edit($id)
  {
    $artikel = new ArtikelModel();

    $validation = \Config\Services::validation();
    $validation->setRules(['judul' => 'required']);
    $isDataValid = $validation->withRequest($this->request)->run();

    if ($isDataValid) {
      $artikel->update(
        $id,
        [
          'judul' => $this->request->getPost('judul'),
          'isi' => $this->request->getPost('isi'),
        ]
      );
      return redirect('admin/artikel');
    }
    $data = $artikel->where('id', $id)->first();
---
SELECT *
FROM `artikel`
WHERE `id` = '17'
 LIMIT 1